Revit 2027 API
BuiltInFailures.ViewSheetFailures Class
 Failures about placing viewports on sheets.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ViewSheetFailures
Public NotInheritable Class ViewSheetFailures
public ref class ViewSheetFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ViewSheetFailures = class end
The BuiltInFailures.ViewSheetFailures type exposes the following members.
Properties
Name | Description
ViewInAModelMustBeUnique |  Sheet views in this model cannot contain more than one instance of "%1!s!."
ViewInAModelMustBeUniqueWarn |  Sheet views in this model cannot contain more than one instance of "%1!s!."
ViewOnASheetCannotBeUncropped3DPerspectiveView |  Sheets do not support uncropped perspective views.
ViewOnASheetMustBeUnique |  Sheet views cannot contain more than one instance of "%1!s!."
ViewOnASheetMustBeUniqueWarn |  Sheet views cannot contain more than one instance of "%1!s!."
ViewportCantContainEmptyView |  Sheet views cannot contain empty view "%1!s!".
Top
See Also
Reference
Autodesk.Revit.DB Namespace